<?php
/**
此类目前只提供时间截的（格式化）换算显示，不参与数据库存
目前对于时间不是很科学，只是暂时的硬性的规定：
一年 = 12个月；
一个月 = 30天；
一天 = 24个小时；
一小时 = 60分；
一分 = 60秒； 
-----------------------------------------
一年 = 31536000秒；
一月 = 2592000秒；
一日 = 86400秒；
一时 = 3600秒；
一分 = 60秒；
一秒 = 1秒；
 * Update time：2014-7-20 17:27:45
 */

class time{
	var $y;
	var $m;
	var $d;
	var $h;
	var $i;
	var $s;
	public function time1($time) {
			$this->y = $y = 0;			//初始化			
			$this->m = $m = 0;			//初始化			
			$this->d = $d = 0;			//初始化			
			$this->h = $h = 0;			//初始化			
			$this->i = $i = 0;			//初始化			
			$this->s = $s = 0;			//初始化		

			$y1 = $time % 31536000;		//余月不足年(1~11月)
			$y2 = $y1 % 2592000;		//余日不足月(1~29天)	
			$y3 = $y2 % 86400;			//余时不足日(1~23小时)
			$y4 = $y3 % 3600;			//余分不足时(1~59分)
			$y5 = $y4 % 60;				//余秒不足分(0~59秒)

		if($time >= 31536000)
			$this->y = (int)($time / 31536000); 	//整除年

		if($time >= 2592000)
			$this->m = (int)($y1 / 2592000); 		//整除月

		if($time >= 86400)
			$this->d = (int)($y2 / 86400);			//整除日

		if($time >= 3600)
			$this->h = (int)($y3 / 3600);			//整除时

		if($y4 >= 60)
			$this->i = (int)($y4 / 60);				//整除分

		$this->s = $y5;								//秒

		if($this->y == 0){			//无年
			if($this->m == 0) {		//无月
				$str = $this->d.'天 '.$this->h.'h '.$this->i.'m '.$this->s.'s';		//1~29天1~23小时1~59分0~59秒
			} else {	// 有月
				return $this->m.'月 '.$this->d.'天 '.$this->h.'h '.$this->i.'m '.$this->s.'s';		//1~11月1~29天1~23小时1~59分0~59秒
			} 

			if($this->d == 0)		//无天
				$str = $this->h.'h '.$this->i.'m '.$this->s.'s';		//1~23小时1~59分0~59秒
			if($this->h == 0)		//无时
				$str = $this->i.'m '.$this->s.'s';		//1~59分 . 0~59秒
			if($this->i == 0 && $this->s >= 0)		//无分有秒
				$str = $this->s.'s';	 	//0~59秒

		}else 		//*年//1~11月1~29天1~23小时1~59分0~59秒
				$str = $this->y.'年 '.$this->m.'月 '.$this->d.'天 '.$this->h.'h '.$this->i.'m '.$this->s.'s';

		return $str;	//返回格式化输出
	}
}